src/cf/InformationRegisters/CRM_ОповещенияПользовательскиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОповещенияПользовательскиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПериодичностьОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыОповещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ПериодичностьОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ПериодичностьОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_КатегорииПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_КатегорииПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ДолжностнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДолжностныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОтписалсяОтEmailРассылок</Name>
					<Comment>Отписался от Email рассылок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Планируемый</Name>
					<Comment>Участвует в планировании проектов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УчаствуетВАнкетировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УровеньДоступа</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_УровниДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фотография</Name>
					<Comment>Фотография клиента частное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_ДополнительнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CRM_ДополнительнаяИнформация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогПодразделенияДляПорученийДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогПользователиДляПорученияДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/CRM_ПользователиПереопределяемый/Ext/Module.bsl
// Процедура создает пользовательскую цветовую категорию по номеру цвета и наименованию.
//
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь
//	Наименование	- Строка			- Наименование
//	нЦвет			- Число, Цвет		- Цвет.
//
Процедура CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, Наименование, нЦвет)
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда Возврат; КонецЕсли;
	НайденнаяЦветоваяГруппа = Справочники.CRM_КатегорииПользователей.НайтиПоНаименованию(Наименование, Истина, , Пользователь);
	Если НЕ ЗначениеЗаполнено(НайденнаяЦветоваяГруппа) Тогда
		СтруктураЦвет = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьЦветПоКлючу(нЦвет);
		Если НЕ (СтруктураЦвет = Неопределено) Тогда
			НоваяКатегория = Справочники.CRM_КатегорииПользователей.СоздатьЭлемент();
			НоваяКатегория.Владелец		= Пользователь;
			НоваяКатегория.Наименование	= Наименование;
			НоваяКатегория.ЦветКрасный	= СтруктураЦвет.Цвет.Красный;
			НоваяКатегория.ЦветСиний	= СтруктураЦвет.Цвет.Синий;
			НоваяКатегория.ЦветЗеленый	= СтруктураЦвет.Цвет.Зеленый;
			НоваяКатегория.ЦветИндекс	= нЦвет;
			НоваяКатегория.Записать();
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры // CRM_СоздатьЦветовуюГруппуПользователя)
	
// Процедура заполняет пользователя предопределенными цветовыми гпруппами.
//
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь.
//
Процедура CRM_ЗаполнитьПредопределеннымиЦветовымиГруппами(Пользователь)
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'Длительные проекты'"),	7);
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'Мелкие задачи'"),		4);
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'Задачи в офисе'"),		24);
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'От шефа'"),				15);
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'Приятные задачи'"),		0);
	CRM_СоздатьЦветовуюГруппуПользователя(Пользователь, НСтр("ru = 'Личные'"),				8);
КонецПроцедуры // CRM_ЗаполнитьПредопределеннымиЦветовымиГруппами()
 
// Процедура заполняет настройки пользователя по умолчанию.
// 
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь.
//
Процедура CRM_ЗаполнитьНастройкиПользователяПоУмолчанию(Пользователь) Экспорт
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда Возврат; КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	CRM_ОбщегоНазначенияСервер.УстановитьНастройкуПользователя(Пользователь,								"ОсновнойОтветственный",				Пользователь);
	CRM_ОбщегоНазначенияСервер.УстановитьНастройкуПользователя(CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию(), "ОсновнаяОрганизация",					Пользователь);
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
	CRM_ЗаполнитьПредопределеннымиЦветовымиГруппами(Пользователь);
	Если НЕ (ПользовательИБ = Неопределено) Тогда
		// Настройки поля отображения содержания.
		CRM_ОбщегоНазначенияСервер.НастройкиПолейОтображенияСодержанияЗагрузитьИзМакета(, ПользовательИБ.Имя);
	КонецЕсли;
	
	// Настройки оповещений
	НаборЗаписей = РегистрыСведений.CRM_ОповещенияПользовательскиеНастройки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	// 1. Значимые события
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ЗавершениеБизнесПроцесса;
	Запись.Напоминание		= Истина;
	
	// Отложено до след. релиза
	//Запись = НаборЗаписей.Добавить();
	//Запись.Пользователь		= Пользователь;
	//Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах;
	//Запись.Напоминание		= Истина;
	//Запись.СрокОповещения	= 30;
	//Запись.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.Минута;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ПросроченныеНеЗавершенныеСобытияЗадачи;
	Запись.Напоминание		= Истина;
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ПросроченныеКонтрольныеТочки;
	Запись.Напоминание		= Истина;
	
	// 2. Оповещения о событиях/задачах.
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ОповещатьОНовыхЗадачах;
	Запись.Напоминание		= Истина;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ОповещатьОПереадресованныхДокументахЗадачах;
	Запись.Напоминание		= Истина;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах;
	Запись.СрокОповещения = 10;
	Запись.Периодичность = Перечисления.CRM_ПериодичностьОповещений.Минута;
	
	// 3. Запланированные события
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.Оповещение_1;
	Запись.Напоминание		= Ложь;
	//Запись.СрокОповещения	= 10;
	//Запись.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.Минута;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.Оповещение_2;
	Запись.ЭлектроннаяПочта	= Ложь;
	//Запись.СрокОповещения	= 1;
	//Запись.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.Час;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.Оповещение_3;
	Запись.СМС				= Ложь;
	//Запись.СрокОповещения	= 10;
	//Запись.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.Минута;
	
	// 4. Дни рождения
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь		= Пользователь;
	Запись.ВидОповещения	= Справочники.CRM_ВидыОповещений.ОповещенияОДняхРождения;
	Запись.Напоминание		= Истина;
	Запись.СрокОповещения	= 1;
	Запись.Периодичность	= Перечисления.CRM_ПериодичностьОповещений.День;
	
	НаборЗаписей.Записать();
	
	// 5. Заполнение пользовательских настроек динамических списков по умолчанию.
	Если НЕ (ПользовательИБ = Неопределено) Тогда
		CRM_ОбщегоНазначенияСервер.ПользовательскиеНастройкиСпискаЗаполнитьПоУмолчанию(, ПользовательИБ.Имя);
	КонецЕсли;
	
	// 6. Заполнение пользовательских настроек работы с почтой по умолчанию.
	Если НЕ (ПользовательИБ = Неопределено) Тогда
		CRM_УправлениеЭлектроннойПочтой.ЗаполнитьНастройкиРаботыСПочтойПоУмолчанию(ПользовательИБ.Имя);
	КонецЕсли;
	
КонецПроцедуры // CRM_ЗаполнитьНастройкиПользователяПоУмолчанию()

// Процедура заполняет настройки всех пользователей по умолчанию.
// 
// Параметры:
//	Нет.
//
Процедура CRM_ЗаполнитьНастройкиВсехПользователейПоУмолчанию() Экспорт
	ПустойУникальныйИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойУникальныйИдентификатор
	|");
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ПустойУникальныйИдентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		CRM_ЗаполнитьНастройкиПользователяПоУмолчанию(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры // CRM_ЗаполнитьНастройкиВсехПользователейПоУмолчанию()
